In [9]:
# import libraries
import pandas as pd
import numpy as np

## Load Data

In [10]:
# save url's to files
basics_url = 'https://datasets.imdbws.com/title.basics.tsv.gz'
akas_url = 'https://datasets.imdbws.com/title.akas.tsv.gz'
ratings_url = 'https://datasets.imdbws.com/title.ratings.tsv.gz'

In [11]:
# read basics to df
basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [12]:
# read akas to df
akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [13]:
# read ratings to df
ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

## Clean Basics df

In [14]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [15]:
basics.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10240758 entries, 0 to 10240757
Data columns (total 9 columns):
 #   Column          Non-Null Count     Dtype
---  ------          --------------     -----
 0   tconst          10240758 non-null  object
 1   titleType       10240758 non-null  object
 2   primaryTitle    10240747 non-null  object
 3   originalTitle   10240747 non-null  object
 4   isAdult         10240758 non-null  object
 5   startYear       10240758 non-null  object
 6   endYear         10240758 non-null  object
 7   runtimeMinutes  10240758 non-null  object
 8   genres          10240740 non-null  object
dtypes: object(9)
memory usage: 703.2+ MB

In [16]:
# replace \N with np.nan
basics.replace({'\\N':np.nan}, inplace = True)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [17]:
basics.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10240758 entries, 0 to 10240757
Data columns (total 9 columns):
 #   Column          Non-Null Count     Dtype
---  ------          --------------     -----
 0   tconst          10240758 non-null  object
 1   titleType       10240758 non-null  object
 2   primaryTitle    10240747 non-null  object
 3   originalTitle   10240747 non-null  object
 4   isAdult         10240757 non-null  object
 5   startYear       8870992 non-null   object
 6   endYear         113760 non-null    object
 7   runtimeMinutes  3088852 non-null   object
 8   genres          9782394 non-null   object
dtypes: object(9)
memory usage: 703.2+ MB

In [18]:
# drop null runtimeMinutes and genres
basics.dropna(subset=['runtimeMinutes','genres'], inplace = True)

In [19]:
basics.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3008120 entries, 0 to 10240757
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          3008120 non-null  object
 1   titleType       3008120 non-null  object
 2   primaryTitle    3008119 non-null  object
 3   originalTitle   3008119 non-null  object
 4   isAdult         3008120 non-null  object
 5   startYear       2817272 non-null  object
 6   endYear         52689 non-null    object
 7   runtimeMinutes  3008120 non-null  object
 8   genres          3008120 non-null  object
dtypes: object(9)
memory usage: 229.5+ MB

In [20]:
# keep titleType movie only
basics = basics[basics['titleType']=='movie']

In [21]:
basics['titleType'].value_counts()

movie    390607
Name: titleType, dtype: int64

In [22]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 390607 entries, 8 to 10240708
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          390607 non-null  object
 1   titleType       390607 non-null  object
 2   primaryTitle    390607 non-null  object
 3   originalTitle   390607 non-null  object
 4   isAdult         390607 non-null  object
 5   startYear       383961 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  390607 non-null  object
 8   genres          390607 non-null  object
dtypes: object(9)
memory usage: 29.8+ MB

In [23]:
# convert startYear to float
basics['startYear'] = basics['startYear'].astype(float)

In [24]:
# create 2000 and 2022 filters
# filer movies with startYear between 2000 and 2022
f1 = basics['startYear']>=2000
f2 = basics['startYear']<=2022

basics = basics[f1 & f2]

In [25]:
# convert startYear to int
basics['startYear'] = basics['startYear'].astype(int)

In [26]:
# check value counts of startYear
basics['startYear'].value_counts()

2018    14442
2017    14433
2019    14183
2016    14012
2015    13536
2022    13324
2014    13175
2021    12559
2013    12425
2012    11687
2020    11667
2011    10809
2010    10247
2009     9403
2008     8206
2007     7000
2006     6567
2005     5875
2004     5235
2003     4634
2002     4155
2001     3901
2000     3666
Name: startYear, dtype: int64

In [27]:
# create documentary filter
# filter basics df where genre is not documentary
is_documentary = basics['genres'].str.contains('documentary', case=False)
basics = basics[~is_documentary]

In [28]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67485,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
67663,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
80548,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

## Clean akas df

In [29]:
# view head of akas
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [30]:
akas = akas[akas['region']=='US']
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
14,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
36,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
41,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [31]:
# replace \N with np.nan
akas.replace({'\\N':np.nan}, inplace = True)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

## Clean ratings df

In [32]:
# view head of ratings
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1892
3  tt0000004            5.5       178
4  tt0000005            6.2      2678

In [33]:
# view info of ratings
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1359504 entries, 0 to 1359503
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1359504 non-null  object
 1   averageRating  1359504 non-null  float64
 2   numVotes       1359504 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 31.1+ MB

In [34]:
# replace \N with np.nan
ratings.replace({'\\N':np.nan}, inplace = True)

In [35]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1359504 entries, 0 to 1359503
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1359504 non-null  object
 1   averageRating  1359504 non-null  float64
 2   numVotes       1359504 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 31.1+ MB

## Keep only US movies

In [36]:
# keep only US movies in basics df
keepers = basics['tconst'].isin(akas['titleId'])

basics = basics[keepers]

In [37]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87339 entries, 34800 to 10240524
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          87339 non-null  object
 1   titleType       87339 non-null  object
 2   primaryTitle    87339 non-null  object
 3   originalTitle   87339 non-null  object
 4   isAdult         87339 non-null  object
 5   startYear       87339 non-null  int32
 6   endYear         0 non-null      object
 7   runtimeMinutes  87339 non-null  object
 8   genres          87339 non-null  object
dtypes: int32(1), object(8)
memory usage: 6.3+ MB

In [38]:
# keep only US movies in ratings df
keepers2 = ratings['tconst'].isin(akas['titleId'])

ratings = ratings[keepers2]

In [39]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 511830 entries, 0 to 1359480
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         511830 non-null  object
 1   averageRating  511830 non-null  float64
 2   numVotes       511830 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.6+ MB

## Create new directory and save files

In [40]:
import os
# create new folder
os.makedirs('Data/', exist_ok=True)

# confirm folder is created
os.listdir('Data/')

['title_akas.csv.gz', 'title_basics.csv.gz', 'title_ratings.csv.gz']

In [42]:
# check final info - basics
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87339 entries, 34800 to 10240524
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          87339 non-null  object
 1   titleType       87339 non-null  object
 2   primaryTitle    87339 non-null  object
 3   originalTitle   87339 non-null  object
 4   isAdult         87339 non-null  object
 5   startYear       87339 non-null  int32
 6   endYear         0 non-null      object
 7   runtimeMinutes  87339 non-null  object
 8   genres          87339 non-null  object
dtypes: int32(1), object(8)
memory usage: 6.3+ MB

In [43]:
# save cleaned dataframe to file - basics
basics.to_csv('Data/title_basics.csv.gz', compression='gzip', index=False)

In [44]:
# open saved file and preview - basics
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory=False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [45]:
# check final info - akas
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1471723 entries, 5 to 37499049
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1471723 non-null  object
 1   ordering         1471723 non-null  int64
 2   title            1471723 non-null  object
 3   region           1471723 non-null  object
 4   language         4167 non-null     object
 5   types            984564 non-null   object
 6   attributes       47609 non-null    object
 7   isOriginalTitle  1470382 non-null  object
dtypes: int64(1), object(7)
memory usage: 101.1+ MB

In [46]:
# save cleaned dataframe to file - akas
akas.to_csv('Data/title_akas.csv.gz', compression='gzip', index=False)

In [47]:
# open saved file and preview - akas
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory=False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [48]:
# check final info - ratings
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 511830 entries, 0 to 1359480
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         511830 non-null  object
 1   averageRating  511830 non-null  float64
 2   numVotes       511830 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.6+ MB

In [49]:
# save cleaned dataframe to file - ratings
ratings.to_csv('Data/title_ratings.csv.gz', compression='gzip', index=False)

In [50]:
# open saved file and preview - ratings
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory=False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838